Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures.InvalidSpareLoad
The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again.

Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures.InvalidPoleNumber
The panel is single phase [wire] wires. The number of poles can not be larger than [value].